package jp.ac.it_college.std.s22028.weather_api

import java.io.Serializable

data class City(
    val name: String,
    val cityId: Int
) : Serializable

val cityList = listOf(
    City("北海道", 2130037),
    City("青森", 2130658),
    City("岩手(盛岡)", 2111834),
    City("宮城(仙台)",  2111149),
    City("秋田",  2113719),
    City("山形",  2110556),
    City("福島",  2112923),
    City("茨城(水戸)", 2111901),
    City("栃木(宇都宮)",  1849053),
    City("群馬(前橋)",  1857843),
    City("埼玉(さいたま)",  1853226),
    City("千葉",  2113014),
    City("東京",  1850144),
    City("神奈川(横浜)",  1848354),
    City("新潟",  1855431),
    City("富山",  1849876),
    City("石川(金沢)",  1860243),
    City("福井",  1863985),
    City("山梨(甲府)", 1859100),
    City("長野",  1856215),
    City("岐阜",  1863641),
    City("静岡",  1851717),
    City("愛知(名古屋)",  1865694),
    City("三重(津)",  1849796),
    City("滋賀(大津)",  1853574),
    City("京都",  1857910),
    City("大阪",  1853909),
    City("兵庫",  1859171),
    City("奈良",  1855612),
    City("和歌山",  1926004),
    City("鳥取",  1849892),
    City("島根(松江)",  1857550),
    City("岡山",  1854383),
    City("広島",  1862415),
    City("山口",  1848689),
    City("徳島", 1850158),
    City("香川(高松)",  1851100),
    City("愛媛(松山)",  1926099),
    City("高知", 1859146),
    City("福岡",  1863967),
    City("佐賀", 1853303),
    City("長崎",  1856177),
    City("熊本",  1858421),
    City("大分", 1854487),
    City("宮崎",  1856717),
    City("鹿児島", 1860827),
    City("沖縄(那覇)", 1856035)
)